In [1]:
from sqlalchemy import Column, Integer, String, Date, Float
from sqlalchemy import create_engine
from sqlalchemy import ForeignKey, Sequence, CheckConstraint, UniqueConstraint
from sqlalchemy import Table, MetaData, text

from sqlalchemy.ext.declarative import declarative_base
import pandas as pd

In [3]:
data = pd.read_csv('AB_NYC_2019.csv')
data

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,8232441,Sabrina,Brooklyn,Bedford-Stuyvesant,40.67853,-73.94995,Private room,70,2,0,NaN,NaN,2,9
48891,36485057,Affordable room in Bushwick/East Williamsburg,6570630,Marisol,Brooklyn,Bushwick,40.70184,-73.93317,Private room,40,4,0,NaN,NaN,2,36
48892,36485431,Sunny Studio at Historical Neighborhood,23492952,Ilgar & Aysel,Manhattan,Harlem,40.81475,-73.94867,Entire home/apt,115,10,0,NaN,NaN,1,27
48893,36485609,43rd St. Time Square-cozy single bed,30985759,Taz,Manhattan,Hell's Kitchen,40.75751,-73.99112,Shared room,55,1,0,NaN,NaN,6,2
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,68119814,Christophe,Manhattan,Hell's Kitchen,40.76404,-73.98933,Private room,90,7,0,NaN,NaN,1,23

In [4]:
neighbourhood_group_list = data[['neighbourhood_group']].drop_duplicates().reset_index().drop(columns = ['index']);
neighbourhood_group_list.index.name = 'id'

neighbourhood_group_list = neighbourhood_group_list.rename(columns = {'neighbourhood_group':'name'})

neighbourhood_group_list

             name
id
0        Brooklyn
1       Manhattan
2          Queens
3   Staten Island
4           Bronx

In [5]:
neighbourhood_list = data[['neighbourhood', 'neighbourhood_group']].drop_duplicates().reset_index().drop(columns = ['index']);
neighbourhood_list.index.name = 'id'

neighbourhood_list = neighbourhood_list.rename(columns = {'neighbourhood':'name'})
neighbourhood_list = neighbourhood_list.rename(columns = {'neighbourhood_group':'neighbourhood_group_id'})

In [6]:
neighbourhood_list['neighbourhood_group_id'] = neighbourhood_list['neighbourhood_group_id'].map(lambda x:  neighbourhood_group_list[neighbourhood_group_list['name'] == x].index.values.astype(int)[0])

neighbourhood_list

             name  neighbourhood_group_id
id
0      Kensington                       0
1         Midtown                       1
2          Harlem                       1
3    Clinton Hill                       0
4     East Harlem                       1
..            ...                     ...
216   Bull's Head                       3
217      New Dorp                       3
218     Rossville                       3
219  Breezy Point                       2
220   Willowbrook                       3

[221 rows x 2 columns]

In [7]:
room_types_list = data[['room_type']].drop_duplicates().reset_index().drop(columns = ['index']);
room_types_list.index.name = 'id'

room_types_list = room_types_list.rename(columns = {'room_type':'type'})

room_types_list

               type
id
0      Private room
1   Entire home/apt
2       Shared room

In [8]:
host_list = data[['host_id','host_name','calculated_host_listings_count']].drop_duplicates().reset_index().drop(columns = ['index']);
host_list.index.name = 'id'

host_list = host_list.rename(columns = {'host_id':'ab_host_id'})
host_list = host_list.rename(columns = {'host_name':'name'})
host_list = host_list.rename(columns = {'calculated_host_listings_count':'listings_count'})

host_list

       ab_host_id           name  listings_count
id
0            2787           John               6
1            2845       Jennifer               2
2            4632      Elisabeth               1
3            4869    LisaRoxanne               1
4            7192          Laura               1
...           ...            ...             ...
37452   274307600       Jonathan               1
37453   274311461          Scott               1
37454   274321313            Kat               1
37455    23492952  Ilgar & Aysel               1
37456    68119814     Christophe               1

[37457 rows x 3 columns]

In [9]:
offers_list = data[['name','host_id','neighbourhood','latitude','longitude','room_type','price','minimum_nights','number_of_reviews','last_review','reviews_per_month','availability_365']].drop_duplicates().reset_index().drop(columns = ['index']);
offers_list.index.name = 'id'

offers_list = offers_list.rename(columns = {'neighbourhood':'neighbourhood_id'})

In [10]:
offers_list['host_id'] = offers_list['host_id'].map(lambda x:  host_list[host_list['ab_host_id'] == x].index.values.astype(int)[0])
offers_list['neighbourhood_id'] = offers_list['neighbourhood_id'].map(lambda x:  neighbourhood_list[neighbourhood_list['name'] == x].index.values.astype(int)[0])
offers_list['room_type'] = offers_list['room_type'].map(lambda x:  room_types_list[room_types_list['type'] == x].index.values.astype(int)[0])

offers_list

,name,host_id,neighbourhood_id,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,availability_365
id,,,,,,,,,,,,
0,Clean & quiet apt home by the park,0,0,40.64749,-73.97237,0,149,1,9,2018-10-19,0.21,365
1,Skylit Midtown Castle,1,1,40.75362,-73.98377,1,225,1,45,2019-05-21,0.38,355
2,THE VILLAGE OF HARLEM....NEW YORK !,2,2,40.80902,-73.94190,0,150,3,0,NaN,NaN,365
3,Cozy Entire Floor of Brownstone,3,3,40.68514,-73.95976,1,89,1,270,2019-07-05,4.64,194
4,Entire Apt: Spacious Studio/Loft by central park,4,4,40.79851,-73.94399,1,80,10,9,2018-11-19,0.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...
48890,Charming one bedroom - newly renovated rowhouse,20153,6,40.67853,-73.94995,0,70,2,0,NaN,NaN,9
48891,Affordable room in Bushwick/East Williamsburg,37316,21,40.70184,-73.93317,0,40,4,0,NaN,NaN,36
48892,Sunny Studio at Historical Neighborhood,37455,2,40.81475,-73.94867,1,115,10,0,NaN,NaN,27
48893,43rd St. Time Square-cozy single bed,25808,7,40.75751,-73.99112,2,55,1,0,NaN,NaN,2
48894,Trendy duplex in the very heart of Hell's Kitchen,37456,7,40.76404,-73.98933,0,90,7,0,NaN,NaN,23

In [117]:
db_string = "postgres://postgres:Hsql@localhost:5432/adb"

engine = create_engine(db_string)
Base = declarative_base()

In [118]:
class Offers(Base):
    __tablename__ = 'offers'
    __table_args__ = (
        CheckConstraint('price >= 0'),        
        CheckConstraint('minimum_nights >= 0'),        
        CheckConstraint('availability >= 0'),        
        CheckConstraint('number_of_reviews >= 0')
    )
    id = Column(Integer, Sequence('seq_offers_id'), primary_key=True)
    name = Column(String(80), nullable = False)
    host_id = Column(Integer, ForeignKey('hosts.id'))
    
    latitude = Column(Float, nullable = False)
    longtitude = Column(Float, nullable = False)
    neighbourhood_id = Column(Integer, ForeignKey('neighbourhoods.id'))
    
    room_type = Column(Integer, ForeignKey('room_types.id'))
    price = Column(Integer, nullable = False)
    minimum_nights = Column(Integer, nullable = False)
    availability = Column(Integer, nullable = False)
    
    number_of_reviews = Column(Integer, nullable = False)
    last_review = Column(Date, nullable = True)
    reviews_per_month = Column(Float, nullable = True)

In [112]:
class Hosts(Base):
    __tablename__ = 'hosts'
    __table_args__ = (
        CheckConstraint('listings_count >= 0'),        
        UniqueConstraint('ab_host_id')
    )
    id = Column(Integer, Sequence('seq_hosts_id'), primary_key=True)
    ab_host_id = Column(Integer, nullable = False)
    name = Column(String(50), nullable = False)
    listings_count = Column(Integer, nullable = False)

In [113]:
class Neighbourhoods(Base):
    __tablename__ = 'neighbourhoods'
    __table_args__ = (
        CheckConstraint('len(name) > 0'),       
        UniqueConstraint('name')
    )
    id = Column(Integer, Sequence('seq_neighbourhoodss_id'), primary_key=True)
    name = Column(String(50), nullable = False)
    neighbourhood_group_id = Column(Integer, ForeignKey('neighbourhood_groups.id'))

In [114]:
class Neighbourhood_groups(Base):
    __tablename__ = 'neighbourhood_groups'
    __table_args__ = (
        CheckConstraint('len(name) > 0'),
    )
    id = Column(Integer, Sequence('seq_neighbourhood_groups_id'), primary_key=True)
    name = Column(String(50), nullable = False)

In [115]:
class Room_types(Base):
    __tablename__ = 'room_types'
    __table_args__ = (
        CheckConstraint('len(type) > 0'),
    )
    id = Column(Integer, Sequence('seq_room_types_id'), primary_key=True)
    type = Column(String(50), nullable = False)

In [ ]:
Base.metadata.create_all(engine)

In [17]:
print(engine.table_names())

['addresses', 'reviews', 'neighbourhood_groups', 'neighbourhoods', 'hosts', 'room_types', 'offers']

In [ ]:
neighbourhood_group_list.to_sql('neighbourhood_groups',engine, if_exists='append')
neighbourhood_list.to_sql('neighbourhoods',engine, if_exists='append')
room_types_list.to_sql('room_types',engine, if_exists='append')
host_list.to_sql('hosts',engine, if_exists='append')
offers_list.to_sql('offers',engine, if_exists='append')

In [69]:
#sql = text('DROP TABLE IF EXISTS offers CASCADE;')
#result = engine.execute(sql)